Autodesk.Revit.DB.Structure.AreaLoad.SetLoops(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop})
Sets curve loops that define geometry of the area load.
Remarks:
This method works with non hosted area load only.
All previously defined reference points will be removed.
doc:
The document that contains the area load.
newLoops:
Loops that define new geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
Returns:
Returns true if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when newLoops collection is empty.
-or-
Thrown when newLoops contains open loop.
-or-
Thrown when newLoops contains a loop consisting of other elements then lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.GetRefPoint(System.Int32)
Returns the physical location of the reference point.
Remarks:
The index should be between 0 and less than NumRefPoints.
index:
The index of the point to return.
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{System.Int32},System.Collections.Generic.IList`1{System.Int32},Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new non-hosted area load within the project.
aDoc:
Document to which new area load will be added.
loops:
The loops that define geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
forceVectors:
The array of force vectors applied to the maximum three reference point of the area load.
refPointCurveIndexes:
The array of maximum three curve indexes on which reference points should be placed on.
refPointCurveSelectors:
The array of maximum three curve selectors (start or end points) indicating where reference points should be placed on.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new non-hosted area load within the project.
aDoc:
Document to which new area load will be added.
loops:
The loops that define geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
forceVector:
The force vector applied to the 1st reference point of the area load.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.Force3
Returns the three dimensional force applied to the 3rd reference point of the area load.
Remarks:
The default force unit is kN/m^2 for metric, and ksf for imperial.

Autodesk.Revit.DB.Structure.AreaLoad.Force2
Returns the three dimensional force applied to the 2nd reference point of the area load.
Remarks:
The default force unit is kN/m^2 for metric, and ksf for imperial.

Autodesk.Revit.DB.Structure.AreaLoad.Force1
Returns the three dimensional force applied to the 1st reference point of the area load.
Remarks:
The default force unit is kN/m^2 for metric, and ksf for imperial.